result/20220702-150607_6f9fa8e9136dd985f88d9c938a18a8499fb94d87/benchmark/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        35241 bytes

Concurrency Level:      1
Time taken for tests:   30.688 seconds
Complete requests:      17
Failed requests:        0
Total transferred:      605421 bytes
HTML transferred:       599097 bytes
Requests per second:    0.55 [#/sec] (mean)
Time per request:       1805.182 [ms] (mean)
Time per request:       1805.182 [ms] (mean, across all concurrent requests)
Transfer rate:          19.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  1786 1805  57.9   1791    2029
Waiting:     1785 1805  57.9   1791    2029
Total:       1786 1805  57.9   1791    2029

Percentage of the requests served within a certain time (ms)
  50%   1791
  66%   1792
  75%   1794
  80%   1797
  90%   1799
  95%   2029
  98%   2029
  99%   2029
 100%   2029 (longest request)